# OLDSelectTrussSystem

## Description
Using the given handle, selects the whole truss system the objects is part of.

```pascal
PROCEDURE OLDSelectTrussSystem(trussHandle : HANDLE);
```

```python

def vs.OLDSelectTrussSystem(trussHandle):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|trussHandle|HANDLE||

## Version
Availability: from Vectorworks 2018
## Category
* Truss Analysis